z_client_xml/updateEmployeeRequest.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:gs="https://www.torryharris.com/soap-ws-demo">
	<soapenv:Header />

	<soapenv:Body>
		<gs:updateEmployeeRequest>
			<gs:employeeId>112</gs:employeeId>
			<gs:firstName>Donu</gs:firstName>
			<gs:salary>46000</gs:salary>
		</gs:updateEmployeeRequest>
	</soapenv:Body>

</soapenv:Envelope>
